{
	"stories": [
		{
			"title": "Tutorial",
			"story": "It is the year 1535, you and your friend went out in the forest to collect some berries and hunt some deer. You split up to increase the chances of finding berries, and report back after two hours. You wait for your friend for a long time, but there’s no sign of him.",
			"start-location": "forest-entrance",
			"locations": [
				{
					"name": "forest-entrance",
					"story": "You're standing at the forest entrance where you decided to meet up. Behind you is the village you're from, but your mind is set on the forest where your lost friend went.",
					"reachable": true,
					"directions": [
						{
							"to": "forest-crossroads",
							"story": "There's a path going deeper into the forest, the path your friend went into initially."
						}
					]
				},
				{
					"name": "forest-crossroads"
					"story": "You're now at a crossroads where the path goes either left to the North or right to the South.",
					"directions": [
						{
							"to": "forest-north",
							"story": "When you look in the distance going North, you see an old ruin."
						},
						{
							"to": "forest-south",
							"story": "The path to the south is going out of the forest towards the beach."
						}
					]
				},
				{
					"name": "forest-north",
					"story": "You're in the North, gratz.",
					"reachable": false,
					"directions": [
						{
							"to": "forest-crossroads",
							"story": "There's a path going back to the crossroads."
						}
					]
				}
			]
		}
	],
	"characters": [
		{
			"name": "Arnoud Krabbius",
			"race": "Half-Orc",
			"title": "The Barbarian",
      "description": "Arnoud is a big, muscular half-orc. He loves fighting, using his gigantic two handed broad axe. Although he is an impressive combatant, he is easily tricked when facing witty enemies.",
      "backstory":  "Arnoud grew up in Arnhem, where 'Messentrekken' was a common move on the streets. This way he learned to always be ready for a fight."
		},
    {
      "name": "Joey Feed'r",
      "race": "Human",
      "title": "Longshot Lackey",
      "description": "He can throw a frikadel like no other.",
      "backstory": "Joey has always enjoyed food, and prefers to have breakfast that isn't particulary healthy. This passion for food gave him exceptional abilities when preparing future meals. He can throw any fast food with great power and accuracy."
    },
    {
      "name": "Spincent",
      "race": "Arachnid",
      "title": "The Scary Spider",
      "description": "Big, Hairy, nasty.",
      "backstory": "After an unfortunate event Spincent grew extra legs, at first this seemed like a disadvantage, but soon he evolved. This turned him into a spider who has the size and strength of a human."
    }
	]
}
